METHODS_NAMES = [
    'Минимизация: Равномерный поиск',
    'Метод половинного деления',
    'Метод золотого сечения',

    'Метод Ньютона-Рафсона',
    'Метод Больцано',
    'Метод секущих',

    'Интервал унимодальности c постоянным шагом',
    'Интервал унимодальности c пропорциональным шагом',
    'Интервал унимодальности c шагом Свенна',

    'Метод Флетчера-Пауэлла',
    'Метод Флетчера-Ривса',
    'Метод Коши',
    'Метод Левенберга-Марквардта',
    'Метод Ньютона',
    'Модифицированный метод Ньютона',
    'Закончить работу',
]
